import random

common_nouns = [
    "время", "человек", "год", "дело", "день", "рука", "раз", "город", "слово", "место", 
    "лицо", "друг", "глаз", "вопрос", "дом", "сторона", "страна", "мир", "случай", 
    "голова", "ребёнок", "сила", "конец", "вид", "система", "часть", "работа", 
    "жизнь","власть", "женщина", "дорога", "образ", "отец", "история", "нога", 
    "вода", "война", "любовь", "минута", "право", "небо", "сын", 
    "душа", "утро", "вечер", "месяц", "комната","ночь", 
    "мать", "вещь", "цель", "народ", "сердце", 
    "шаг", "девушка", "машина", "уровень","окно","ответ",
    "условие","начало","свет","действие","век","школа",
    "газета","плечо","путь","дверь","язык","любовь",
    "порядок","автор","гость","закон","число","идея",
    "смерть","сон","ресурс","лес","проблема",
    "искусство","река","проект","журнал",
    "стена","товарищ","книга","письмо",
    "помощь","группа","участие"
]

def display_hangman(tries):
    stages = [
        """
      +---+
      |   |
          |
          |
          |
          |
        =========""",
        """
      +---+
      |   |
      O   |
          |
          |
          |
        =========""",
        """
      +---+
      |   |
      O   |
      |   |
          |
          |
        =========""",
        """
      +---+
      |   |
      O   |
     /|   |
          |
          |
        =========""",
        """
      +---+
      |   |
      O   |
     /|\\  |
          |
          |
        =========""",
        """
      +---+
      |   |
      O   |
     /|\\  |
     /     |
          |
        =========""",
        """
      +---+
      |   |
      O   |
     /|\\  |
     / \\  |
          |
        =========""",
    ]
    return stages[tries]

def t(playfield, answer):
    guess = ""
    for i in answer:
        if i in playfield:
            guess += f"{i} "
        else:
            guess += "_ "
    return guess.strip()

def main(): 
    while True:
        answer = random.choice(common_nouns)
        guessed_letters = []
        tries = 0
        playfield = "" 

        print("Загаданное слово: ", answer)

        while tries < 7: 
            print(display_hangman(tries))
            gui = t(playfield, answer)
            print(gui)

            if "_" not in gui:
                print("Ты выжил сынуля...")
                break
            
            playfield += input("Введите букву: ").lower()

            if playfield[-1] not in answer or len(playfield[-1]) != 1:
                tries += 1

        if tries == 7:
            print("Ты повис сынуля...")
            print(f"Загаданное слово: {answer}")

        user = input("Хочешь сыграть еще сынок? (y/n): ").lower()
        if user not in ["y", "yes", "д"]:
            print("Пока...")
            break

if __name__ == "__main__":
    main()